Catalogs/НаборыИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НаборыИнвестиционныхДеклараций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСКД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаУсловийОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КодыВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВТорговыхСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
						<v8:Type>cfg:CatalogRef.Опционы</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКодовВТорговыхСистемах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыКодовВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКодовВТорговыхСистемах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КодНаММВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаRTSBoard</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодВДепозитарии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CFI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ISIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаММВБКраткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаRTSStandart</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/БазисыКонтроляИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>БазисыКонтроляИнвестиционныхДеклараций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСКД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПолученияБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСКД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Акции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Акции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыАкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиНоминал</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйРегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВыпуск</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВыпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерЭмиссииШт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииОтчетаОбИтогахВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАннулирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйАктивЦБРФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУчетныхАктивовЦБРФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НаборыИнвестиционныхДеклараций/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СформироватьОписание(Неопределено);
	ПроверитьФильтрРейтингов(Отказ);
	Отказ = ТребуетсяОптимизацияОтбора();
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УсловияОтбора = Компоновщик.ПолучитьНастройки();
	ТекущийОбъект.УсловияОтбора = Новый ХранилищеЗначения(УсловияОтбора, Новый СжатиеДанных(9));
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаборДанныхПриИзменении(Элемент)
	НаборДанныхПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастройкиОтборПриАктивизацииСтроки(Элемент)
	ОбновитьДоступностьЗагрузкиСписка();
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастройкиОтборПриИзменении(Элемент)
	ОбновитьДоступностьЗагрузкиСписка();
КонецПроцедуры


#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура СформироватьОписание(Команда)
	
	КоличествоПодчиненных = Компоновщик.Настройки.Отбор.Элементы.Количество();
	Описание = "";
	МассивЭлементов = Новый Массив;
	
	Для каждого ЭлементОтбора Из Компоновщик.Настройки.Отбор.Элементы Цикл
		
		ОписаниеТекущегоЭлемента = ПолучитьПредставлениеОтбора(ЭлементОтбора, МассивЭлементов);
		Если ОписаниеТекущегоЭлемента <> "" Тогда
		    МассивЭлементов.Добавить(ОписаниеТекущегоЭлемента);
		КонецЕсли; 
			
	КонецЦикла; 
	
	Разделитель = Символы.ПС + " И " + Символы.ПС;
	Описание = СтрСоединить(МассивЭлементов, Разделитель);
	
	Объект.Описание = ?(Описание = "", "Без отбора", Описание);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзСписка(Команда)
	
	МассивКодов = ОткрытьФормуМодально("Справочник.НаборыИнвестиционныхДеклараций.Форма.ЗагрузкаСписка");
	Если ТипЗнч(МассивКодов) = Тип("Массив") Тогда
		ДобавитьСтрокиПоМассивуКодов(МассивКодов);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Для каждого НаборДанных Из Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьСписокНаборовДанных() Цикл
		ЗаполнитьЗначенияСвойств(Элементы.НаборДанных.СписокВыбора.Добавить(), НаборДанных);
	КонецЦикла;
	
	УсловияОтбора = Неопределено;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		УсловияОтбора = Параметры.ЗначениеКопирования.УсловияОтбора.Получить();
		Объект.Описание = "";
		
	ИначеЕсли Не Параметры.Ключ.Пустая() Тогда
		
		СправочникОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.НаборыИнвестиционныхДеклараций"));
		УсловияОтбора = СправочникОбъект.УсловияОтбора.Получить();
		РедактированиеЗапрещено = СправочникОбъект.РедактированиеЗапрещено(); 
		Элементы.НаборДанных.ТолькоПросмотр = РедактированиеЗапрещено;
		Элементы.КомпоновщикНастройкиОтбор.ТолькоПросмотр = РедактированиеЗапрещено;
		
	ИначеЕсли ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") И Параметры.ЗначенияЗаполнения.Свойство("Отбор") И ТипЗнч(Параметры.ЗначенияЗаполнения.Отбор) = Тип("ОтборКомпоновкиДанных") Тогда
		
		УсловияОтбора = Новый НастройкиКомпоновкиДанных;
		Справочники.ИнвестиционныеДекларации.ЗаполнитьОтбор(УсловияОтбора.Отбор, Параметры.ЗначенияЗаполнения.Отбор);
				
	КонецЕсли; 
	
	НаборДанныхПриИзмененииНаСервере(УсловияОтбора);
	
КонецПроцедуры

&НаСервере
Процедура НаборДанныхПриИзмененииНаСервере(НастройкиКомпоновщикаДанных = Неопределено)
	
	// сохраним настройки, чтоб не потерять
	Если НастройкиКомпоновщикаДанных = Неопределено Тогда
		НастройкиКомпоновщикаДанных = ЭтаФорма.Компоновщик.ПолучитьНастройки();
	КонецЕсли; 
	
	СКД = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьСКДБазиса(Объект.НаборДанных);
	Если ТипЗнч(СКД) = Тип("СхемаКомпоновкиДанных") Тогда
	
		ЭтаФорма.АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
	
		// инициализируем компоновщик и загружаем старые настройки
		ЭтаФорма.Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтаФорма.АдресСКД));
		ЭтаФорма.Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновщикаДанных);
		ЭтаФорма.Компоновщик.Восстановить();

	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить СКД выбранного набора данных");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастройкиОтборПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПредставлениеОтбора(ЭлементОтбора, МассивЭлементов)

	Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		
		Если ЭлементОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
			Префикс = "НЕ (";
		Иначе
			Префикс = "(";
		КонецЕсли; 
		
		МассивПодчиненных = Новый Массив;
		
		Для каждого ЭлементГруппы Из ЭлементОтбора.Элементы Цикл
			
			ПредставлениеТекущегоЭлемента = ПолучитьПредставлениеОтбора(ЭлементГруппы, МассивПодчиненных);
			Если ПредставлениеТекущегоЭлемента <> "" Тогда
			    МассивПодчиненных.Добавить(ПредставлениеТекущегоЭлемента);
			КонецЕсли; 
		
		КонецЦикла; 
		
		Разделитель = Символы.ПС + ?(ЭлементОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли, " ИЛИ ", " И ") + Символы.ПС;
		ПредставлениеОтбора = Префикс + СтрСоединить(МассивПодчиненных, Разделитель) + ")";
			
	Иначе
		
		ДоступноеПолеОтбораЛевоеЗначение = Компоновщик.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ЭлементОтбора.ЛевоеЗначение);
		Если ДоступноеПолеОтбораЛевоеЗначение = Неопределено Тогда
			Возврат "";
		КонецЕсли; 
		
		ВидыСравненияСписок = Новый Массив;
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.ВИерархии);
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.НеВИерархии);
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии);
		
		ЛевоеЗначение = ДоступноеПолеОтбораЛевоеЗначение.Заголовок;
		ТекВидСравнения = ЭлементОтбора.ВидСравнения;
		
		Если ВидыСравненияСписок.Найти(ТекВидСравнения) = Неопределено Тогда
			
			ПравоеЗначение = ЭлементОтбора.ПравоеЗначение;
			
		Иначе
			
			ПравоеЗначение = "";
			
			Если ДоступноеПолеОтбораЛевоеЗначение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Облигации"))
				Или ДоступноеПолеОтбораЛевоеЗначение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Акции")) Тогда
			
				ПравоеЗначение = ПолучитьПравоеЗначение(ЭлементОтбора.ПравоеЗначение);
				
			Иначе
				
				Для каждого ЭлементСписка Из ЭлементОтбора.ПравоеЗначение Цикл
					ПравоеЗначение = ПравоеЗначение + "; " + Символы.ПС + ЭлементСписка.Значение;
				КонецЦикла; 
				
			КонецЕсли; 
			
			ПравоеЗначение = Сред(ПравоеЗначение, 2);
		
		КонецЕсли;
		
		Если ТипЗнч(ПравоеЗначение) = Тип("ПолеКомпоновкиДанных") Тогда
			ПравоеЗначение = Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(ПравоеЗначение).Заголовок;
		КонецЕсли; 
		
		ПравоеЗначение = """" + ПравоеЗначение + """";
		
		ПредставлениеОтбора = ЛевоеЗначение + " " + ТекВидСравнения + " " + ПравоеЗначение;
		
	КонецЕсли; 
	
	Возврат ПредставлениеОтбора;
	
КонецФункции

&НаСервере
Процедура ДобавитьСтрокиПоМассивуКодов(МассивКодов)

	СписокОбъектов = Компоновщик.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элементы.КомпоновщикНастройкиОтбор.ТекущаяСтрока).ПравоеЗначение;
	СписокОбъектов.Очистить();
	
	ТаблицаКодов = Новый ТаблицаЗначений;
	ТаблицаКодов.Колонки.Добавить("Код", Метаданные.РегистрыСведений.КодыВТорговыхСистемах.Ресурсы.Код.Тип);
	Для каждого ЭлементМассива Из МассивКодов Цикл
	    НоваяСтрока = ТаблицаКодов.Добавить();
		НоваяСтрока.Код = ЭлементМассива;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаКодов", ТаблицаКодов);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаКодов.Код КАК Код
		|ПОМЕСТИТЬ _ТаблицаКодов
		|ИЗ
		|	&ТаблицаКодов КАК ТаблицаКодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	_ТаблицаКодов.Код КАК Код,
		|	ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследних.Объект, ЕСТЬNULL(Акции.Ссылка, ЕСТЬNULL(Облигации.Ссылка, ЕСТЬNULL(ИпотечныеСертификатыУчастия.Ссылка, НЕОПРЕДЕЛЕНО)))) КАК Объект
		|ИЗ
		|	_ТаблицаКодов КАК _ТаблицаКодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО _ТаблицаКодов.Код = КодыВТорговыхСистемахСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|		ПО _ТаблицаКодов.Код = Акции.ГосударственныйРегистрационныйНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ТаблицаКодов.Код = Облигации.ГосударственныйРегистрационныйНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИпотечныеСертификатыУчастия КАК ИпотечныеСертификатыУчастия
		|		ПО _ТаблицаКодов.Код = ИпотечныеСертификатыУчастия.ГосударственныйРегистрационныйНомер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Объект = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден объект по рег. номеру/ISIN:" + Выборка.Код);
		Иначе
			СписокОбъектов.Добавить(Выборка.Объект);
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьЗагрузкиСписка()

	ТекСтрока = Элементы.КомпоновщикНастройкиОтбор.ТекущиеДанные;
	
	ВидыСравненияСписок = Новый Массив;
	ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
	ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ДоступностьЗагрузкиСписка = (Объект.НаборДанных = "Основной" И ТекСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Основные.Актив") 
		И Не ВидыСравненияСписок.Найти(ТекСтрока.ВидСравнения) = Неопределено);
	
	Элементы.КомпоновщикНастройкиОтборЗагрузитьИзСписка.Доступность = ДоступностьЗагрузкиСписка;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПравоеЗначение(ЭлементОтбораПравоеЗначение)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВТорговыхСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК Код
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|			&Период,
		|			Объект В (&ПравоеЗначение)
		|				И ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних";
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПравоеЗначение", ЭлементОтбораПравоеЗначение);
	Результат = Запрос.Выполнить().Выгрузить();
	
	ПравоеЗначение = "";
	Для каждого ЭлементСписка Из ЭлементОтбораПравоеЗначение Цикл
		
		НайденнаяСтрока = Результат.Найти(ЭлементСписка.Значение, "Объект");
		Если НайденнаяСтрока = Неопределено Тогда
			Подстрока = СокрЛП(ЭлементСписка.Значение);
		Иначе
			Подстрока = СокрЛП(ЭлементСписка.Значение) + " / " + НайденнаяСтрока.Код;
		КонецЕсли; 
		ПравоеЗначение = ПравоеЗначение + "; " + Символы.ПС + Подстрока;
		
	КонецЦикла;
	
	Возврат ПравоеЗначение;

КонецФункции

&НаКлиенте 
Процедура ПроверитьФильтрРейтингов(Отказ)

	Отбор = Компоновщик.Настройки.Отбор.Элементы;
	
	ИсточникиРейтингов = Новый Массив;
	ИсточникиРейтингов.Добавить(Новый ПолеКомпоновкиДанных("Рейтинги.Группа1.Источник"));
	ИсточникиРейтингов.Добавить(Новый ПолеКомпоновкиДанных("Рейтинги.Группа2.ИсточникДоп"));
	ИсточникиРейтингов.Добавить(Новый ПолеКомпоновкиДанных("Рейтинги.Группа3.ИсточникДоп2"));
	
	ОтборыРейтингов = Новый Структура;
	ОтборыРейтингов.Вставить("ПолеФильтр", Новый ПолеКомпоновкиДанных("Рейтинги.ИсточникФильтр"));
	ОтборыРейтингов.Вставить("ПоляИсточники", ИсточникиРейтингов);
	ОтборыРейтингов.Вставить("ИспользуемыеШкалы", Новый Массив);

	ЗаполнитьОтборыРейтингов(Отбор, ОтборыРейтингов);
	
	ТекстВопроса = "";
	Если ОтборыРейтингов.ИспользуемыеШкалы.Количество() > 0 Тогда
		
		ОтборФильтр = Неопределено;
		ОтборыРейтингов.Свойство("ОтборФильтр", ОтборФильтр);
		Если ОтборФильтр = Неопределено Тогда
			ТекстВопроса = "Добавить отбор по полю 'Список шкал (Фильтр)'?";
		Иначе
			Если ТипЗнч(ОтборФильтр.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				ЗначениеОтбора = ОтборФильтр.ПравоеЗначение.ВыгрузитьЗначения();
			Иначе
				ЗначениеОтбора = РаботаСКоллекциями.ЗначениеВМассив(ОтборФильтр.ПравоеЗначение);
			КонецЕсли;
			Если Не РаботаСКоллекциями.СпискиЗначенийИдентичны(ЗначениеОтбора, ОтборыРейтингов.ИспользуемыеШкалы) Тогда
				ТекстВопроса = "Обновить отбор по полю 'Список шкал (Фильтр)'?";
			ИначеЕсли ОтборФильтр.Родитель <> Неопределено Тогда
				ТекстВопроса = "Отбор по полю 'Список шкал (Фильтр)' должнен находиться на верхнем уровне. Переместить?";
			КонецЕсли; 			
		КонецЕсли; 
		
		Если ОтборыРейтингов.ИспользуемыеШкалы.Количество() = 1 Тогда
			ОтборыРейтингов.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
			ПравоеЗначение = ОтборыРейтингов.ИспользуемыеШкалы[0];
		Иначе
			ОтборыРейтингов.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.ВСписке);
			ПравоеЗначение = Новый СписокЗначений;
			ПравоеЗначение.ЗагрузитьЗначения(ОтборыРейтингов.ИспользуемыеШкалы);
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ТекстВопроса <> "" Тогда
		ВыборПользователя = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Если ВыборПользователя = КодВозвратаДиалога.Да Тогда
		
			Если ОтборФильтр <> Неопределено Тогда
				Если ОтборФильтр.Родитель = Неопределено Тогда
					Отбор.Удалить(ОтборФильтр);
				Иначе
					ОтборФильтр.Родитель.Элементы.Удалить(ОтборФильтр);
				КонецЕсли; 
			КонецЕсли; 
			
			ОтборФильтр = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборФильтр.ЛевоеЗначение = ОтборыРейтингов.ПолеФильтр;
			ОтборФильтр.ВидСравнения = ОтборыРейтингов.ВидСравнения;
			ОтборФильтр.ПравоеЗначение = ПравоеЗначение;
			
		ИначеЕсли ВыборПользователя = КодВозвратаДиалога.Отмена Тогда
			
			Отказ = Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
	              
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьОтборыРейтингов(ЭлементыОтбора, ОтборыРейтингов)

	Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ЗаполнитьОтборыРейтингов(ЭлементОтбора.Элементы, ОтборыРейтингов);
		Иначе
			Если ОтборыРейтингов.ПоляИсточники.Найти(ЭлементОтбора.ЛевоеЗначение) <> Неопределено Тогда
				Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СписокЗначений") Тогда
					Для каждого ЭлементСписка Из ЭлементОтбора.ПравоеЗначение Цикл
						Если ОтборыРейтингов.ИспользуемыеШкалы.Найти(ЭлементСписка.Значение) = Неопределено Тогда
							ОтборыРейтингов.ИспользуемыеШкалы.Добавить(ЭлементСписка.Значение);
						КонецЕсли;
					КонецЦикла; 
				Иначе
					Если ОтборыРейтингов.ИспользуемыеШкалы.Найти(ЭлементОтбора.ПравоеЗначение) = Неопределено Тогда
						ОтборыРейтингов.ИспользуемыеШкалы.Добавить(ЭлементОтбора.ПравоеЗначение);
					КонецЕсли;
				КонецЕсли; 
			ИначеЕсли ЭлементОтбора.ЛевоеЗначение = ОтборыРейтингов.ПолеФильтр Тогда
				ОтборыРейтингов.Вставить("ОтборФильтр", ЭлементОтбора);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 

КонецФункции

&НаКлиенте
Функция ТребуетсяОптимизацияОтбора()

	ТребуетсяОптимизацияОтбора = Ложь;
	
	НастройкиКомпоновкиДанных = Неопределено;
	Если ПроверитьВозможностьОптимизацииНастроекОтбораНаСервере(НастройкиКомпоновкиДанных) Тогда
		Результат = ОткрытьФормуМодально("Справочник.НаборыИнвестиционныхДеклараций.Форма.ФормаПросмотраОтбора", Новый Структура("НастройкиКомпоновкиДанных", НастройкиКомпоновкиДанных));
		Если ТипЗнч(Результат) = Тип("КодВозвратаДиалога") И Результат = КодВозвратаДиалога.ОК Тогда
			Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
		Иначе
			ТребуетсяОптимизацияОтбора = Истина;
		КонецЕсли; 
	КонецЕсли; 	
	
	Возврат ТребуетсяОптимизацияОтбора;

КонецФункции

&НаСервере
Функция ПроверитьВозможностьОптимизацииНастроекОтбораНаСервере(НастройкиКомпоновкиДанных)

	НастройкиКомпоновкиДанных = Компоновщик.ПолучитьНастройки();
	
	Отбор = НастройкиКомпоновкиДанных.Отбор;
	
	// т.к. нет возможности скопировать настройки компоновки данных, загрузим их в ХЗ
	НастройкиХранилище = Новый ХранилищеЗначения(НастройкиКомпоновкиДанных);
	НовыеНастройки = НастройкиХранилище.Получить();
	НовыйОтбор = НовыеНастройки.Отбор;
	НовыйОтбор.Элементы.Очистить();
	
	Справочники.НаборыИнвестиционныхДеклараций.НормализоватьОтбор(Отбор, НовыйОтбор, Ложь);
	Справочники.НаборыИнвестиционныхДеклараций.РазгруппироватьОтбор(НовыйОтбор);
	
	ТекстНабора = ПолучитьТекстХМЛ(Отбор);
	ТекстНовогоНабора = ПолучитьТекстХМЛ(НовыйОтбор);
	
	ТребуетсяОптимизация = (ТекстНабора <> ТекстНовогоНабора);
	
	Если ТребуетсяОптимизация Тогда
		НастройкиКомпоновкиДанных = НовыеНастройки;
	КонецЕсли; 	
	
	Возврат ТребуетсяОптимизация;

КонецФункции
 
&НаСервере
Функция ПолучитьТекстХМЛ(Значение)

	ТипЗначения = ТипЗнч(Значение);
	
	ИмяТипа = "Filter";
	ПространствоИмен = "http://v8.1c.ru/8.1/data-composition-system/settings";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, ИмяТипа, ПространствоИмен);
	Возврат ЗаписьXML.Закрыть();

КонецФункции

#КонецОбласти
